{            
    "Choices": {
        "SetAppointment": ["I want to set up an appointment",
        "I want to schedule an appointment",
        "I would like to make an appointment",
        "Please schedule an appointment for me"]
        ,

        "GetAppointment": ["I would like to know my current appointment",
         "I would like to check my existing appointment details",
         "I want to know the details about my existing appointment"]
         ,

         "ExitProgram": ["Please stop the program", "Quit", "Stop program", "Quit program"]
    },

    "SetAppointment_Responses": {
        "firstResponse": ["OK, setting an appointment requires a few details from you.",
        "Alright, we would have to acquire some details from you to process your appointment.",
        "Got that, but first we would like to get a few information from you to complete this process."]
        ,

        "secondResponse": ["Alright, please indicate which medical department would you like to consult with.",
                           "Next, which department would you like to go?"]
        ,

        "thirdResponse": ["Last step, please type your contact number so that we have a means to contact you",
                          "Final step to wrap everything up: please type your contact number for communication purposes"]
    },

    "GetAppointment_Responses": ["OK, please enter your appointment code",
     "Got it, alright so please enter your appointment code",
     "Sure thing, please type your appointment code"],

     "UnrecognizedCommand_Responses":["Did you mistyped somehow? I do not recognize that command. T_T",
    "Unfortunately, my programming does not include that command in the responses I can process. >.<",
    "Woops, I do not recognize that command of yours. Sorry!",
    "Please type the appropriate command since I cannot process that. Sorry.",
    "That's too advanced for me to recognize, it seems. I don't have it in my commands, sorry."],
   

    "Error_Responses_Department": ["Sorry, but we don't have that kind of department in the hospital.", 
    "It seems that we don't have that department in our hospital. Please type an appropriate one.",
    "Apologies, but we don't offer that department right now. Please use an existing one based on the available choices."],

    "Medical_Departments": ["Cardiology", "Pediatrics", "Otorhinolaryngology", "Hematology"]
}